// Задача 0
Console.Write("Введите значение:  ");
string s = Console.ReadLine()!;
int num = int.Parse(s);



Console.WriteLine(num*num);
